src/Documents/Scan_ЗаказНаЗакупку/Scan_ЗаказНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаказНаЗакупку</name>
  <basedOn>Document.Scan_ЗапросНаНадстройки</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НестандартныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦентрЗатрат</name>
    <type>
      <types>CatalogRef.Scan_ЦентрыЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗапросНаНадстройки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОНомерЗаказаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОДатаЗаказаНаЗакупку</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОСтатусЗаказаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПроцессСогласованияЗапущен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BBНомерЗаказаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BBДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BBДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПродуктыКЗаказу</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродуктЗапросаНаНадстройку</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаПродуктаЗапросаНаНадстройки</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.Scan_СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаЗавод</name>
      <type>
        <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийДляПоставщика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийВнутренний</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_СоответствияТиповВидовИГрупп/Scan_СоответствияТиповВидовИГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СоответствияТиповВидовИГрупп</name>
  <comment>Соответствия типов, видов и групп продуктов</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИзделийOFMS</name>
    <type>
      <types>EnumRef.Scan_ГруппыИзделийOFMS</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГруппаПродукта</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПродукта</name>
    <type>
      <types>CatalogRef.Scan_ВидыПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_ЗаказыНаЗавод/Scan_ЗаказыНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ЗаказыНаЗавод</name>
  <comment>Предварительно справочник</comment>
  <attributes>
    <name>DDDeviation</name>
    <type>
      <types>CatalogRef.Scan_ПричиныОтклоненийПоDD</types>
    </type>
  </attributes>
  <attributes>
    <name>DDPriority</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГотовностьТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБукингЛиста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБукингЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойСтатусЗаказа</name>
    <type>
      <types>CatalogRef.Scan_ЗаводскиеСтатусыЗаказаНаЗавод</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикCOW</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуOFMSПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАдресаДоставки</name>
    <type>
      <types>CatalogRef.Scan_КодыАдресовДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КузовщикиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроизводства</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НапоминаниеДилерамОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБукингЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецЗаказчика</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНаЗакупку</name>
    <attributes>
      <name>Кузовщик</name>
      <type>
        <types>CatalogRef.Scan_Контрагенты</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаЗакупку</name>
      <type>
        <types>String</types>
        <types>DocumentRef.Scan_ЗаказНаЗакупку</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ЗаказНаЗакупку/Forms/ФормаСозданияПрицепов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Поставщик") Тогда
		Поставщик = Параметры.Поставщик;	
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаказНаЗакупку") Тогда
		ЗаказНаЗакупку = Параметры.ЗаказНаЗакупку;	
	КонецЕсли;
	
	Если Параметры.Свойство("Наименование") Тогда
		Наименование = Параметры.Наименование;	
	КонецЕсли;
	
	Если Параметры.Свойство("МаркаПродукта") Тогда
		МаркаПродукта = Параметры.МаркаПродукта;	
	КонецЕсли;
	
	Если Параметры.Свойство("МассивПрицепов") Тогда
		Для Каждого ТекЭлемент Из Параметры.МассивПрицепов Цикл
			НоваяСтрока = ТаблицаСозданныхПрицепов.Добавить();
			НоваяСтрока.Продукт = ТекЭлемент.Продукт;
			НоваяСтрока.IDExternalSystemProduct = ТекЭлемент.Продукт.IDExternalSystemProduct;
			НоваяСтрока.Цена = ТекЭлемент.Цена;
			НоваяСтрока.СтавкаНДС = ТекЭлемент.СтавкаНДС;
			НоваяСтрока.Валюта = ТекЭлемент.Валюта;
			НоваяСтрока.ЗаказНаЗавод = ТекЭлемент.ЗаказНаЗавод;
			НоваяСтрока.НомераЗаказов = ТекЭлемент.НомераЗаказов;
		КонецЦикла;
	КонецЕсли;
	
	// Проверим, возможно в справочниках есть уже созданные продукты, которые не были применены
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_Изделия.Ссылка КАК Продукт,
		|	Scan_Изделия.IDExternalSystemProduct КАК IDExternalSystemProduct,
		|	Scan_Изделия.ЗаказНаЗавод КАК ЗаказНаЗавод,
		|	Scan_Изделия.ЗаказНаЗавод.Наименование КАК НомераЗаказов
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.ЗаказНаЗавод.Наименование ПОДОБНО &НомерЗаказаНаЗакупку
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомераЗаказов";
	
	ШаблонНомераЗаказа = Формат(ЗаказНаЗакупку.Дата,"ДФ=""гггг""") + "-" + ЗаказНаЗакупку.Номер + "%"; 
	Запрос.УстановитьПараметр("НомерЗаказаНаЗакупку",  ШаблонНомераЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыОтбора = Новый Структура("Продукт", ВыборкаДетальныеЗаписи.Продукт);		
		Если ТаблицаСозданныхПрицепов.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
			НоваяСтрока = ТаблицаСозданныхПрицепов.Добавить();
			НоваяСтрока.Продукт = ВыборкаДетальныеЗаписи.Продукт;
			НоваяСтрока.IDExternalSystemProduct = ВыборкаДетальныеЗаписи.IDExternalSystemProduct;
			НоваяСтрока.ЗаказНаЗавод = ВыборкаДетальныеЗаписи.ЗаказНаЗавод;
			НоваяСтрока.НомераЗаказов = ВыборкаДетальныеЗаписи.НомераЗаказов;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаСозданныхПрицеповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаСозданныхПрицепов.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Продукт) 
		И Элемент.ТекущийЭлемент = Элементы.ТаблицаСозданныхПрицеповПродукт Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыОткрытия = Новый Структура("Ключ",ТекущиеДанные.Продукт);
		ОткрытьФорму("Справочник.Scan_Изделия.Форма.ФормаЭлементаНовая",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущиеДанные.ЗаказНаЗавод) 
		И Элемент.ТекущийЭлемент = Элементы.ТаблицаСозданныхПрицеповЗаказНаЗавод Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыОткрытия = Новый Структура("Ключ",ТекущиеДанные.ЗаказНаЗавод);
		ОткрытьФорму("Справочник.Scan_ЗаказыНаЗавод.Форма.ФормаЭлементаНовая",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПрицепы(Команда)
	ЕстьОшибки = Ложь;
	
	Если НЕ ЗначениеЗаполнено(МодельПродукта) Тогда
		Сообщить(НСтр("ru = 'Поле ""Модель"" не заполнено!'; en = 'Model is not filled!'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МаркаПродукта) Тогда
		Сообщить(НСтр("ru = 'Поле ""Марка"" не заполнено!'; en = 'Mark is not filled!'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипПродукта) Тогда
		Сообщить(НСтр("ru = 'Поле ""Тип продукта"" не заполнено!'; en = 'Product type is not filled'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Количество > 100 Тогда
		Сообщить(НСтр("ru = 'Нельзя создать больше 100 продуктов.'; en = 'Unable to create more then 100 products!'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьПрицепыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПрицепыНаСервере()
	НомерКонечногоЗаказа = ТаблицаСозданныхПрицепов.Количество();
	Для Сч = 1 По Количество Цикл
		// Создадим заказ на завод
		НовыйЗаказНаЗавод = Справочники.Scan_ЗаказыНаЗавод.СоздатьЭлемент();
		НомерКонечногоЗаказа = НомерКонечногоЗаказа + 1;
		НаименованиеЗаказа = Формат(ЗаказНаЗакупку.Дата,"ДФ=""гггг""") + "-" + ЗаказНаЗакупку.Номер + "-" + НомерКонечногоЗаказа; 
	
		НовыйЗаказНаЗавод.Наименование = НаименованиеЗаказа;
		НовыйЗаказНаЗавод.СозданВручную = Истина;
		Попытка
			НовыйЗаказНаЗавод.Записать();			
		Исключение
			ВывестиСообщениеПол(НСтр("ru = 'Ошибка записи заказа <%1>: %2'"),,,,, НовыйЗаказНаЗавод.Наименование, ОписаниеОшибки());
			Продолжить;	
		КонецПопытки;
		
		// Создадим продукт
		НовыйПрицеп = Справочники.Scan_Изделия.СоздатьЭлемент();
		НовыйПрицеп.Наименование = Наименование;
		НовыйПрицеп.МодельПродукта = МодельПродукта;
		НовыйПрицеп.МаркаПродукта = МаркаПродукта;
		НовыйПрицеп.ТипПродукта = ТипПродукта;
		НовыйПрицеп.ГруппаИзделийOFMS = ГруппаИзделийOFMS;
		НовыйПрицеп.ЗаказНаЗавод = НовыйЗаказНаЗавод.Ссылка;
		НовыйПрицеп.СозданВручную = Истина;
		НовыйПрицеп.НомерИзделия = НовыйЗаказНаЗавод.Наименование;
		
		
		СформированноеНаименование = Справочники.Scan_Изделия.СформироватьНаименованиеПоНастройке(НовыйПрицеп);
		Если НовыйПрицеп.Наименование = "" И СформированноеНаименование <> "" Тогда
			НовыйПрицеп.Наименование = СформированноеНаименование;
		КонецЕсли;
		
		Попытка
			НовыйПрицеп.Записать();
			// Добавим в таблицу
			НоваяСтрока = ТаблицаСозданныхПрицепов.Добавить();
			НоваяСтрока.Продукт = НовыйПрицеп.Ссылка;
			НоваяСтрока.Цена = Цена;
			НоваяСтрока.СтавкаНДС = СтавкаНДС;
			НоваяСтрока.Валюта = Валюта;
			НоваяСтрока.ЗаказНаЗавод = НовыйПрицеп.ЗаказНаЗавод;
			НоваяСтрока.НомераЗаказов = НовыйПрицеп.ЗаказНаЗавод.Наименование;
		Исключение
			ВывестиСообщениеПол(НСтр("ru = 'Ошибка записи продукта: %1'"),,,,, ОписаниеОшибки());
		КонецПопытки; 	
		
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВ1БД(Команда)
	Для Каждого ТекСтрока Из ТаблицаСозданныхПрицепов Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.IDExternalSystemProduct) Тогда
			IDПрицепа = ПередатьВ1БДНаСервере(ТекСтрока.Продукт);
			ТекСтрока.IDExternalSystemProduct = IDПрицепа;
		КонецЕсли;
	КонецЦикла;	  		
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)   	
	МассивПрицепов = Новый Массив;
	
	Для Каждого ТекСтрока Из ТаблицаСозданныхПрицепов Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Продукт", ТекСтрока.Продукт);
		СтруктураДанных.Вставить("Цена", ТекСтрока.Цена);
		СтруктураДанных.Вставить("СтавкаНДС", ТекСтрока.СтавкаНДС);
		СтруктураДанных.Вставить("Валюта", ТекСтрока.Валюта);
		СтруктураДанных.Вставить("ЗаказНаЗавод", ТекСтрока.ЗаказНаЗавод); 
		СтруктураДанных.Вставить("НомераЗаказов", ТекСтрока.НомераЗаказов); 
		
		МассивПрицепов.Добавить(СтруктураДанных);
	КонецЦикла;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("МассивПрицепов", МассивПрицепов);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПередатьВ1БДНаСервере(ПрицепСсылка)
	
	ПараметрыВызова = Новый Структура;
	
	ПараметрыВызова.Вставить("НомерИзделия",     ПрицепСсылка.ЗаказНаЗавод.Наименование);
	ПараметрыВызова.Вставить("Наименование",     ПрицепСсылка.Наименование);
	ПараметрыВызова.Вставить("МаркаПродукта",    ПрицепСсылка.МаркаПродукта);
	ПараметрыВызова.Вставить("ТипПродукта",      ПрицепСсылка.ТипПродукта);
	ПараметрыВызова.Вставить("ВидПродукта",      ПрицепСсылка.ТипПродукта.ВидПродукта);
	ПараметрыВызова.Вставить("ТипМаркетинговый", ПрицепСсылка.ТипыМаркетинговые);
	
	ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод_CreateProduct(ПараметрыВызова);
	Если ОтветСервиса = Неопределено Тогда
		Сообщить(НСтр("ru = 'Ошибка передачи данных 1БД! Продукт не создан в 1БД.'; en = 'Failed to create product!'"));
	Иначе
		ПрицепОбъект = ПрицепСсылка.ПолучитьОбъект();
		ПрицепОбъект.IDExternalSystemProduct = ОтветСервиса;
		Попытка
			ПрицепОбъект.Заблокировать();
			ПрицепОбъект.Записать();
			Возврат ПрицепОбъект.IDExternalSystemProduct;
		Исключение
			Сообщить(НСтр("ru = 'Ошибка записи продукта! Продукт не записан.'; en = 'Failed to save product!'"));
		КонецПопытки;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ТипПродуктаПриИзмененииНаСервере()
	ГруппаИзделийOFMS = РегистрыСведений.Scan_СоответствияТиповВидовИГрупп.ПолучитьГруппуИзделийOFMSПоТипу(ТипПродукта);	
КонецПроцедуры

&НаКлиенте
Процедура ТипПродуктаПриИзменении(Элемент)
	ТипПродуктаПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти
